# boolean -логическая переменная
var_bool1 = True  # булева переменная - правда/ложь
var_bool2 = False  # булевая переменная - правда/ложь

# integer целое число
var_int1 = 12  # целочисленная переменная
var_int2 = -10  # целочисленная переменная

# Float переменная со знаками после запятой
var_float1 = 12.14  # переменная с плавающей точкой
var_float2 = -10.00  # переменная с плавающей точкой

# string - строка символьный тип данных
var_str1 = ""  # пустая строка
var_str2 = "Анатолий"  # строка с определенными данными
var_str3 = "12"  # строка с определенными данными
var_str4 = '-10.0'  # строка с определенным типом данных, с использованием другого типа ковычек
var_str5 = " There "  # строка с определенным типом данных, с использованием разных типов ковычек
var_str6 = """ he"re """  # строка с определенным типом данных, с использованием глобальных внешних ковычек

# list массив(список переменных, необязательно одного типа)
var_list1 = [12, 16, 8, -100]  # массив переменных
var_list2 = [12, True, 8, -10.00]  # массив переменных

# dict - словарь (key - value) (ключ/значение)
var_dict1 = {
    "first key": -10.00,

}

var_dict2 = {
    "first key": -10.00,
    "second key": [12, True, 8, -10.00],
    "third key": "Анатолий",
    "four key": {
        "first key": -10.00,
        "second key": [12, True, 8, -10.00],
        "third key": "Анатолий",
    }

}

# tuple - кортеж (неизменяемый тип данных)
var_tuple1 = (12, 16, 8, -100)  # массив неизменяемых переменных
var_tuple2 = (12, True, 8, -10.00)  # массив неизменяемых переменных

# константа - постоянный неизменяемый тип данных
VAR_TUPLE1 = 12  # условно неизменяемый тип данных


print("hello world")
